Tekla Open API Reference for Tekla Structures 2025
StraightDimension Constructor (ViewBase, Point, Point, Vector, Double)
 Initializes a new instance of the StraightDimension class using "standard" attributes.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StraightDimension(
	ViewBase targetView,
	Point startPoint,
	Point endPoint,
	Vector upDirection,
	double distance
)
Public Sub New (
	targetView As ViewBase,
	startPoint As Point,
	endPoint As Point,
	upDirection As Vector,
	distance As Double
)
Parameters
targetView
Type: Tekla.Structures.Drawing.ViewBase
The target view of the dimension.
startPoint
Type: Tekla.Structures.Geometry3d.Point
The start point of the dimension.
endPoint
Type: Tekla.Structures.Geometry3d.Point
The end point of the dimension.
upDirection
Type: Tekla.Structures.Geometry3d.Vector
The up direction.
distance
Type: System.Double
The height of the dimension.
See Also
Reference
StraightDimension Class
StraightDimension Overload
Tekla.Structures.Drawing Namespace